
&НаКлиенте
Процедура ПересчитатьСуммы(Команда)
	ДанныеПоТоварам = Объект.Товары;
	Для Каждого СтрокаТовара Из ДанныеПоТоварам Цикл
		ПересчитатьСуммуВСтроке(СтрокаТовара);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ПересчитатьСуммуВСтроке(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ПересчитатьСуммуВСтроке(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные.Количество = 0 Тогда
		ТекущиеДанные.Цена = 0;
	Иначе	
		ТекущиеДанные.Цена = Окр(ТекущиеДанные.Сумма / ТекущиеДанные.Количество, 2);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуВСтроке(СтрокаТовара)
	СтрокаТовара.Сумма = СтрокаТовара.Количество * СтрокаТовара.Цена;		
КонецПроцедуры	